
IDENTIFICATION DIVISION . 
PROGRAM_ID . Lex_cobword . 
AUTHOR . 
DATE_WRITTEN . 
DATE_COMPILED . 
ENVIRONMENT DIVISION . 
CONFIGURATION SECTION . 
DATA DIVISION . 
WORKING_STORAGE SECTION . 

Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP VALUE + Integer . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP VALUE + Integer . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 

Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 

Integer Lex_cobword . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 

Integer Lex_cobword . 

Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE 
Nonnumeric_sq . 
Integer FILLER REDEFINES Lex_cobword . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 

Integer Lex_cobword . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 



Integer Lex_cobword . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 



Integer FILLER PIC Lex_cobword ( Integer ) VALUE LOW_VALUES . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE LOW_VALUES . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP VALUE + Integer . 
Integer Lex_cobword PIC Integer ( Integer ) COMP VALUE Integer . 
Integer Lex_cobword PIC Integer ( Integer ) COMP VALUE Integer . 
Integer Lex_cobword PIC Integer ( Integer ) COMP VALUE Integer . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE Nonnumeric_sq . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE SPACES . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE LOW_VALUES . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE SPACES . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE LOW_VALUES . 
Integer Lex_cobword . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE SPACES . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE SPACES . 
Integer Lex_cobword REDEFINES 
Lex_cobword PIC Lex_cobword ( Integer ) . 


Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE LOW_VALUES . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE SPACES . 
Integer Lex_cobword REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE SPACES . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE LOW_VALUE . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE SPACES . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq . 
Integer Lex_cobword VALUE Nonnumeric_sq Nonnumeric_sq 
Nonnumeric_sq Nonnumeric_sq 
Nonnumeric_sq Nonnumeric_sq 
Nonnumeric_sq . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE LOW_VALUE . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) VALUE LOW_VALUES . 
Integer FILLER REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer FILLER REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP_4 . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer FILLER REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer FILLER REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer FILLER REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer FILLER REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer FILLER REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) VALUE LOW_VALUES . 



Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword . 
COPY Lex_cobword . 



Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
COPY Lex_cobword . 



Integer Lex_cobword . 
Integer FILLER PIC Integer ( Integer ) COMP VALUE Integer . 
Integer FILLER PIC Integer ( Integer ) COMP VALUE Integer . 
Integer FILLER PIC Lex_cobword VALUE HIGH_VALUES . 



Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER REDEFINES Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 



LINKAGE SECTION . 



Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP_3 . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP_3 . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP_3 . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer FILLER PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) COMP . 
Integer Lex_cobword PIC Lex_cobword ( Integer ) . 



PROCEDURE DIVISION USING Lex_cobword
Lex_cobword
Lex_cobword
Lex_cobword
Lex_cobword
Lex_cobword
Lex_cobword .




Lex_cobword SECTION . 
PERFORM Lex_cobword . 
PERFORM Lex_cobword 
UNTIL Lex_cobword NOT = SPACES 
AND NOT = Nonnumeric_sq . 
CALL Nonnumeric_sq USING Lex_cobword . 
MOVE ZERO TO RETURN_CODE . 
GOBACK . 



Lex_cobword SECTION . 
PERFORM Lex_cobword . 
PERFORM Lex_cobword 
PERFORM Lex_cobword . 
PERFORM Lex_cobword . 
PERFORM Lex_cobword . 


Lex_cobword SECTION . 


IF Lex_cobword EQUAL LOW_VALUE 
MOVE Nonnumeric_sq TO Lex_cobword 
GO TO Lex_cobword . 


MOVE Nonnumeric_sq TO Lex_cobword 
MOVE SPACE TO Lex_cobword 
MOVE ZERO TO Lex_cobword 
Lex_cobword 


IF Lex_cobword NOT EQUAL Nonnumeric_sq 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
ELSE 
IF Lex_cobword EQUAL Nonnumeric_sq 
MOVE Nonnumeric_sq TO Lex_cobword 
ELSE 
IF Lex_cobword EQUAL Nonnumeric_sq 
MOVE Nonnumeric_sq TO Lex_cobword 
ELSE 
IF Lex_cobword EQUAL Nonnumeric_sq 
MOVE Nonnumeric_sq TO Lex_cobword 
ELSE 
IF Lex_cobword EQUAL Nonnumeric_sq 
MOVE Nonnumeric_sq TO Lex_cobword 
ELSE 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword . 



Lex_cobword SECTION . 
PERFORM Lex_cobword . 
IF Lex_cobword = SPACES 
PERFORM Lex_cobword . 


Lex_cobword SECTION . 


IF Lex_cobword = Nonnumeric_sq 
PERFORM Lex_cobword 
ELSE 
IF Lex_cobword = Nonnumeric_sq 
PERFORM Lex_cobword 
ELSE 
IF Lex_cobword = Nonnumeric_sq 
PERFORM Lex_cobword 
ELSE 
IF Lex_cobword = Nonnumeric_sq 
PERFORM Lex_cobword 
ELSE 
MOVE Integer TO Lex_cobword 
MOVE SPACES TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Lex_cobword TO Lex_cobword 
PERFORM Lex_cobword . 

Lex_cobword SECTION . 



CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword . 

Lex_cobword SECTION . 



CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword . 

Lex_cobword SECTION . 



CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword . 

Lex_cobword SECTION . 



CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword . 







Lex_cobword SECTION . 

CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword . 
IF Lex_cobword NOT = Nonnumeric_sq 
MOVE Integer TO Lex_cobword 
MOVE Lex_cobword TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Lex_cobword TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
CALL Nonnumeric_sq 
PERFORM Lex_cobword 
ELSE 
CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword 
IF Lex_cobword NOT = Nonnumeric_sq 
MOVE Integer TO Lex_cobword 
MOVE Lex_cobword TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
CALL Nonnumeric_sq 
PERFORM Lex_cobword 
ELSE 
CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword 
IF Lex_cobword NOT = Nonnumeric_sq 
MOVE Integer TO Lex_cobword 
MOVE Lex_cobword TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
CALL Nonnumeric_sq 
PERFORM Lex_cobword . 




Lex_cobword SECTION . 
CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword . 
IF Lex_cobword NOT = Nonnumeric_sq 
AND NOT = Nonnumeric_sq 
AND NOT = SPACES 
MOVE Integer TO Lex_cobword 
MOVE Lex_cobword TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
CALL Nonnumeric_sq 
PERFORM Lex_cobword . 

IF Lex_cobword NOT = Integer 
AND Lex_cobword = SPACES 
MOVE Integer TO Lex_cobword 
MOVE SPACES TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
CALL Nonnumeric_sq 
PERFORM Lex_cobword . 




Lex_cobword SECTION . 
MOVE SPACES TO Lex_cobword . 
CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword . 
IF Lex_cobword NOT = Nonnumeric_sq 
AND NOT = Nonnumeric_sq 
AND NOT = SPACES 
MOVE Integer TO Lex_cobword 
MOVE Lex_cobword TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
CALL Nonnumeric_sq 
PERFORM Lex_cobword . 
IF Lex_cobword EQUAL Lex_cobword 
MOVE Lex_cobword TO Lex_cobword . 


IF Lex_cobword = SPACES 
CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 


Lex_cobword SECTION . 
IF Lex_cobword = Nonnumeric_sq 
MOVE Nonnumeric_sq TO Lex_cobword 
ELSE 
MOVE Lex_cobword TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE Nonnumeric_sq TO Lex_cobword 
MOVE ZERO TO Lex_cobword 
MOVE SPACE TO Lex_cobword 
MOVE Lex_cobword TO Lex_cobword . 


Lex_cobword SECTION . 

MOVE SPACE TO Lex_cobword . 
MOVE Nonnumeric_sq TO Lex_cobword . 

IF Lex_cobword = Nonnumeric_sq 
MOVE Nonnumeric_sq TO Lex_cobword 
ELSE 
CALL Nonnumeric_sq USING Lex_cobword . 

CALL Nonnumeric_sq USING Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 
Lex_cobword 


CALL Nonnumeric_sq USING Lex_cobword .